MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAR176/mcu.h
extern volatile __C2FIFOINT18bits_t C2FIFOINT18bits __asm__ ("C2FIFOINT18") __attribute__((section("sfrs"), address(0xBF8817E0)));
extern volatile uint32_t        C2FIFOINT18CLR __attribute__((section("sfrs"),address(0xBF8817E4)));
extern volatile uint32_t        C2FIFOINT18SET __attribute__((section("sfrs"),address(0xBF8817E8)));
extern volatile uint32_t        C2FIFOINT18INV __attribute__((section("sfrs"),address(0xBF8817EC)));
#define C2FIFOUA18 C2FIFOUA18
extern volatile uint32_t   C2FIFOUA18 __attribute__((section("sfrs"), address(0xBF8817F0)));
extern volatile uint32_t        C2FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF8817F4)));
extern volatile uint32_t        C2FIFOUA18SET __attribute__((section("sfrs"),address(0xBF8817F8)));
extern volatile uint32_t        C2FIFOUA18INV __attribute__((section("sfrs"),address(0xBF8817FC)));
#define C2FIFOCI18 C2FIFOCI18
extern volatile uint32_t   C2FIFOCI18 __attribute__((section("sfrs"), address(0xBF881800)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI18bits_t;
extern volatile __C2FIFOCI18bits_t C2FIFOCI18bits __asm__ ("C2FIFOCI18") __attribute__((section("sfrs"), address(0xBF881800)));
extern volatile uint32_t        C2FIFOCI18CLR __attribute__((section("sfrs"),address(0xBF881804)));
extern volatile uint32_t        C2FIFOCI18SET __attribute__((section("sfrs"),address(0xBF881808)));
extern volatile uint32_t        C2FIFOCI18INV __attribute__((section("sfrs"),address(0xBF88180C)));
#define C2FIFOCON19 C2FIFOCON19
extern volatile uint32_t   C2FIFOCON19 __attribute__((section("sfrs"), address(0xBF881810)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON19bits_t;
extern volatile __C2FIFOCON19bits_t C2FIFOCON19bits __asm__ ("C2FIFOCON19") __attribute__((section("sfrs"), address(0xBF881810)));
extern volatile uint32_t        C2FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF881814)));
extern volatile uint32_t        C2FIFOCON19SET __attribute__((section("sfrs"),address(0xBF881818)));
extern volatile uint32_t        C2FIFOCON19INV __attribute__((section("sfrs"),address(0xBF88181C)));
#define C2FIFOINT19 C2FIFOINT19
extern volatile uint32_t   C2FIFOINT19 __attribute__((section("sfrs"), address(0xBF881820)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT19bits_t;
extern volatile __C2FIFOINT19bits_t C2FIFOINT19bits __asm__ ("C2FIFOINT19") __attribute__((section("sfrs"), address(0xBF881820)));
extern volatile uint32_t        C2FIFOINT19CLR __attribute__((section("sfrs"),address(0xBF881824)));
extern volatile uint32_t        C2FIFOINT19SET __attribute__((section("sfrs"),address(0xBF881828)));
extern volatile uint32_t        C2FIFOINT19INV __attribute__((section("sfrs"),address(0xBF88182C)));
#define C2FIFOUA19 C2FIFOUA19
extern volatile uint32_t   C2FIFOUA19 __attribute__((section("sfrs"), address(0xBF881830)));
extern volatile uint32_t        C2FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF881834)));
extern volatile uint32_t        C2FIFOUA19SET __attribute__((section("sfrs"),address(0xBF881838)));
extern volatile uint32_t        C2FIFOUA19INV __attribute__((section("sfrs"),address(0xBF88183C)));
#define C2FIFOCI19 C2FIFOCI19
extern volatile uint32_t   C2FIFOCI19 __attribute__((section("sfrs"), address(0xBF881840)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI19bits_t;
extern volatile __C2FIFOCI19bits_t C2FIFOCI19bits __asm__ ("C2FIFOCI19") __attribute__((section("sfrs"), address(0xBF881840)));
extern volatile uint32_t        C2FIFOCI19CLR __attribute__((section("sfrs"),address(0xBF881844)));
extern volatile uint32_t        C2FIFOCI19SET __attribute__((section("sfrs"),address(0xBF881848)));
extern volatile uint32_t        C2FIFOCI19INV __attribute__((section("sfrs"),address(0xBF88184C)));
#define C2FIFOCON20 C2FIFOCON20
extern volatile uint32_t   C2FIFOCON20 __attribute__((section("sfrs"), address(0xBF881850)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON20bits_t;
extern volatile __C2FIFOCON20bits_t C2FIFOCON20bits __asm__ ("C2FIFOCON20") __attribute__((section("sfrs"), address(0xBF881850)));
extern volatile uint32_t        C2FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF881854)));
extern volatile uint32_t        C2FIFOCON20SET __attribute__((section("sfrs"),address(0xBF881858)));
extern volatile uint32_t        C2FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88185C)));
#define C2FIFOINT20 C2FIFOINT20
extern volatile uint32_t   C2FIFOINT20 __attribute__((section("sfrs"), address(0xBF881860)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT20bits_t;
