MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAR176/mcu.h
  .extern C1RXF21          /* 0xBF880290 */
  .extern C1RXF21CLR       /* 0xBF880294 */
  .extern C1RXF21SET       /* 0xBF880298 */
  .extern C1RXF21INV       /* 0xBF88029C */
  .extern C1RXF22          /* 0xBF8802A0 */
  .extern C1RXF22CLR       /* 0xBF8802A4 */
  .extern C1RXF22SET       /* 0xBF8802A8 */
  .extern C1RXF22INV       /* 0xBF8802AC */
  .extern C1RXF23          /* 0xBF8802B0 */
  .extern C1RXF23CLR       /* 0xBF8802B4 */
  .extern C1RXF23SET       /* 0xBF8802B8 */
  .extern C1RXF23INV       /* 0xBF8802BC */
  .extern C1RXF24          /* 0xBF8802C0 */
  .extern C1RXF24CLR       /* 0xBF8802C4 */
  .extern C1RXF24SET       /* 0xBF8802C8 */
  .extern C1RXF24INV       /* 0xBF8802CC */
  .extern C1RXF25          /* 0xBF8802D0 */
  .extern C1RXF25CLR       /* 0xBF8802D4 */
  .extern C1RXF25SET       /* 0xBF8802D8 */
  .extern C1RXF25INV       /* 0xBF8802DC */
  .extern C1RXF26          /* 0xBF8802E0 */
  .extern C1RXF26CLR       /* 0xBF8802E4 */
  .extern C1RXF26SET       /* 0xBF8802E8 */
  .extern C1RXF26INV       /* 0xBF8802EC */
  .extern C1RXF27          /* 0xBF8802F0 */
  .extern C1RXF27CLR       /* 0xBF8802F4 */
  .extern C1RXF27SET       /* 0xBF8802F8 */
  .extern C1RXF27INV       /* 0xBF8802FC */
  .extern C1RXF28          /* 0xBF880300 */
  .extern C1RXF28CLR       /* 0xBF880304 */
  .extern C1RXF28SET       /* 0xBF880308 */
  .extern C1RXF28INV       /* 0xBF88030C */
  .extern C1RXF29          /* 0xBF880310 */
  .extern C1RXF29CLR       /* 0xBF880314 */
  .extern C1RXF29SET       /* 0xBF880318 */
  .extern C1RXF29INV       /* 0xBF88031C */
  .extern C1RXF30          /* 0xBF880320 */
  .extern C1RXF30CLR       /* 0xBF880324 */
  .extern C1RXF30SET       /* 0xBF880328 */
  .extern C1RXF30INV       /* 0xBF88032C */
  .extern C1RXF31          /* 0xBF880330 */
  .extern C1RXF31CLR       /* 0xBF880334 */
  .extern C1RXF31SET       /* 0xBF880338 */
  .extern C1RXF31INV       /* 0xBF88033C */
  .extern C1FIFOBA         /* 0xBF880340 */
  .extern C1FIFOBACLR      /* 0xBF880344 */
  .extern C1FIFOBASET      /* 0xBF880348 */
  .extern C1FIFOBAINV      /* 0xBF88034C */
  .extern C1FIFOCON0       /* 0xBF880350 */
  .extern C1FIFOCON0CLR    /* 0xBF880354 */
  .extern C1FIFOCON0SET    /* 0xBF880358 */
  .extern C1FIFOCON0INV    /* 0xBF88035C */
  .extern C1FIFOINT0       /* 0xBF880360 */
  .extern C1FIFOINT0CLR    /* 0xBF880364 */
  .extern C1FIFOINT0SET    /* 0xBF880368 */
  .extern C1FIFOINT0INV    /* 0xBF88036C */
  .extern C1FIFOUA0        /* 0xBF880370 */
  .extern C1FIFOUA0CLR     /* 0xBF880374 */
  .extern C1FIFOUA0SET     /* 0xBF880378 */
  .extern C1FIFOUA0INV     /* 0xBF88037C */
  .extern C1FIFOCI0        /* 0xBF880380 */
  .extern C1FIFOCI0CLR     /* 0xBF880384 */
  .extern C1FIFOCI0SET     /* 0xBF880388 */
  .extern C1FIFOCI0INV     /* 0xBF88038C */
  .extern C1FIFOCON1       /* 0xBF880390 */
  .extern C1FIFOCON1CLR    /* 0xBF880394 */
  .extern C1FIFOCON1SET    /* 0xBF880398 */
  .extern C1FIFOCON1INV    /* 0xBF88039C */
  .extern C1FIFOINT1       /* 0xBF8803A0 */
  .extern C1FIFOINT1CLR    /* 0xBF8803A4 */
  .extern C1FIFOINT1SET    /* 0xBF8803A8 */
  .extern C1FIFOINT1INV    /* 0xBF8803AC */
  .extern C1FIFOUA1        /* 0xBF8803B0 */
  .extern C1FIFOUA1CLR     /* 0xBF8803B4 */
  .extern C1FIFOUA1SET     /* 0xBF8803B8 */
  .extern C1FIFOUA1INV     /* 0xBF8803BC */
  .extern C1FIFOCI1        /* 0xBF8803C0 */
  .extern C1FIFOCI1CLR     /* 0xBF8803C4 */
  .extern C1FIFOCI1SET     /* 0xBF8803C8 */
  .extern C1FIFOCI1INV     /* 0xBF8803CC */
  .extern C1FIFOCON2       /* 0xBF8803D0 */
  .extern C1FIFOCON2CLR    /* 0xBF8803D4 */
  .extern C1FIFOCON2SET    /* 0xBF8803D8 */
  .extern C1FIFOCON2INV    /* 0xBF8803DC */
  .extern C1FIFOINT2       /* 0xBF8803E0 */
  .extern C1FIFOINT2CLR    /* 0xBF8803E4 */
  .extern C1FIFOINT2SET    /* 0xBF8803E8 */
  .extern C1FIFOINT2INV    /* 0xBF8803EC */
  .extern C1FIFOUA2        /* 0xBF8803F0 */
  .extern C1FIFOUA2CLR     /* 0xBF8803F4 */
  .extern C1FIFOUA2SET     /* 0xBF8803F8 */
  .extern C1FIFOUA2INV     /* 0xBF8803FC */
  .extern C1FIFOCI2        /* 0xBF880400 */
  .extern C1FIFOCI2CLR     /* 0xBF880404 */
  .extern C1FIFOCI2SET     /* 0xBF880408 */
  .extern C1FIFOCI2INV     /* 0xBF88040C */
  .extern C1FIFOCON3       /* 0xBF880410 */
  .extern C1FIFOCON3CLR    /* 0xBF880414 */
  .extern C1FIFOCON3SET    /* 0xBF880418 */
  .extern C1FIFOCON3INV    /* 0xBF88041C */
  .extern C1FIFOINT3       /* 0xBF880420 */
  .extern C1FIFOINT3CLR    /* 0xBF880424 */
  .extern C1FIFOINT3SET    /* 0xBF880428 */
  .extern C1FIFOINT3INV    /* 0xBF88042C */
  .extern C1FIFOUA3        /* 0xBF880430 */
  .extern C1FIFOUA3CLR     /* 0xBF880434 */
  .extern C1FIFOUA3SET     /* 0xBF880438 */
  .extern C1FIFOUA3INV     /* 0xBF88043C */
  .extern C1FIFOCI3        /* 0xBF880440 */
  .extern C1FIFOCI3CLR     /* 0xBF880444 */
  .extern C1FIFOCI3SET     /* 0xBF880448 */
  .extern C1FIFOCI3INV     /* 0xBF88044C */
  .extern C1FIFOCON4       /* 0xBF880450 */
  .extern C1FIFOCON4CLR    /* 0xBF880454 */
  .extern C1FIFOCON4SET    /* 0xBF880458 */
  .extern C1FIFOCON4INV    /* 0xBF88045C */
  .extern C1FIFOINT4       /* 0xBF880460 */
  .extern C1FIFOINT4CLR    /* 0xBF880464 */
  .extern C1FIFOINT4SET    /* 0xBF880468 */
  .extern C1FIFOINT4INV    /* 0xBF88046C */
  .extern C1FIFOUA4        /* 0xBF880470 */
  .extern C1FIFOUA4CLR     /* 0xBF880474 */
  .extern C1FIFOUA4SET     /* 0xBF880478 */
  .extern C1FIFOUA4INV     /* 0xBF88047C */
  .extern C1FIFOCI4        /* 0xBF880480 */
  .extern C1FIFOCI4CLR     /* 0xBF880484 */
  .extern C1FIFOCI4SET     /* 0xBF880488 */
  .extern C1FIFOCI4INV     /* 0xBF88048C */
  .extern C1FIFOCON5       /* 0xBF880490 */
  .extern C1FIFOCON5CLR    /* 0xBF880494 */
  .extern C1FIFOCON5SET    /* 0xBF880498 */
  .extern C1FIFOCON5INV    /* 0xBF88049C */
  .extern C1FIFOINT5       /* 0xBF8804A0 */
  .extern C1FIFOINT5CLR    /* 0xBF8804A4 */
  .extern C1FIFOINT5SET    /* 0xBF8804A8 */
  .extern C1FIFOINT5INV    /* 0xBF8804AC */
  .extern C1FIFOUA5        /* 0xBF8804B0 */
  .extern C1FIFOUA5CLR     /* 0xBF8804B4 */
  .extern C1FIFOUA5SET     /* 0xBF8804B8 */
  .extern C1FIFOUA5INV     /* 0xBF8804BC */
  .extern C1FIFOCI5        /* 0xBF8804C0 */
  .extern C1FIFOCI5CLR     /* 0xBF8804C4 */
  .extern C1FIFOCI5SET     /* 0xBF8804C8 */
  .extern C1FIFOCI5INV     /* 0xBF8804CC */
  .extern C1FIFOCON6       /* 0xBF8804D0 */
  .extern C1FIFOCON6CLR    /* 0xBF8804D4 */
  .extern C1FIFOCON6SET    /* 0xBF8804D8 */
  .extern C1FIFOCON6INV    /* 0xBF8804DC */
  .extern C1FIFOINT6       /* 0xBF8804E0 */
  .extern C1FIFOINT6CLR    /* 0xBF8804E4 */
  .extern C1FIFOINT6SET    /* 0xBF8804E8 */
  .extern C1FIFOINT6INV    /* 0xBF8804EC */
  .extern C1FIFOUA6        /* 0xBF8804F0 */
  .extern C1FIFOUA6CLR     /* 0xBF8804F4 */
  .extern C1FIFOUA6SET     /* 0xBF8804F8 */
  .extern C1FIFOUA6INV     /* 0xBF8804FC */
  .extern C1FIFOCI6        /* 0xBF880500 */
  .extern C1FIFOCI6CLR     /* 0xBF880504 */
  .extern C1FIFOCI6SET     /* 0xBF880508 */
  .extern C1FIFOCI6INV     /* 0xBF88050C */
  .extern C1FIFOCON7       /* 0xBF880510 */
  .extern C1FIFOCON7CLR    /* 0xBF880514 */
  .extern C1FIFOCON7SET    /* 0xBF880518 */
  .extern C1FIFOCON7INV    /* 0xBF88051C */
  .extern C1FIFOINT7       /* 0xBF880520 */
  .extern C1FIFOINT7CLR    /* 0xBF880524 */
  .extern C1FIFOINT7SET    /* 0xBF880528 */
  .extern C1FIFOINT7INV    /* 0xBF88052C */
  .extern C1FIFOUA7        /* 0xBF880530 */
  .extern C1FIFOUA7CLR     /* 0xBF880534 */
  .extern C1FIFOUA7SET     /* 0xBF880538 */
  .extern C1FIFOUA7INV     /* 0xBF88053C */
  .extern C1FIFOCI7        /* 0xBF880540 */
  .extern C1FIFOCI7CLR     /* 0xBF880544 */
  .extern C1FIFOCI7SET     /* 0xBF880548 */
  .extern C1FIFOCI7INV     /* 0xBF88054C */
  .extern C1FIFOCON8       /* 0xBF880550 */
  .extern C1FIFOCON8CLR    /* 0xBF880554 */
  .extern C1FIFOCON8SET    /* 0xBF880558 */
  .extern C1FIFOCON8INV    /* 0xBF88055C */
  .extern C1FIFOINT8       /* 0xBF880560 */
  .extern C1FIFOINT8CLR    /* 0xBF880564 */
  .extern C1FIFOINT8SET    /* 0xBF880568 */
  .extern C1FIFOINT8INV    /* 0xBF88056C */
  .extern C1FIFOUA8        /* 0xBF880570 */
  .extern C1FIFOUA8CLR     /* 0xBF880574 */
  .extern C1FIFOUA8SET     /* 0xBF880578 */
  .extern C1FIFOUA8INV     /* 0xBF88057C */
  .extern C1FIFOCI8        /* 0xBF880580 */
  .extern C1FIFOCI8CLR     /* 0xBF880584 */
  .extern C1FIFOCI8SET     /* 0xBF880588 */
  .extern C1FIFOCI8INV     /* 0xBF88058C */
  .extern C1FIFOCON9       /* 0xBF880590 */
  .extern C1FIFOCON9CLR    /* 0xBF880594 */
  .extern C1FIFOCON9SET    /* 0xBF880598 */
  .extern C1FIFOCON9INV    /* 0xBF88059C */
  .extern C1FIFOINT9       /* 0xBF8805A0 */
  .extern C1FIFOINT9CLR    /* 0xBF8805A4 */
  .extern C1FIFOINT9SET    /* 0xBF8805A8 */
  .extern C1FIFOINT9INV    /* 0xBF8805AC */
  .extern C1FIFOUA9        /* 0xBF8805B0 */
  .extern C1FIFOUA9CLR     /* 0xBF8805B4 */
  .extern C1FIFOUA9SET     /* 0xBF8805B8 */
  .extern C1FIFOUA9INV     /* 0xBF8805BC */
  .extern C1FIFOCI9        /* 0xBF8805C0 */
  .extern C1FIFOCI9CLR     /* 0xBF8805C4 */
  .extern C1FIFOCI9SET     /* 0xBF8805C8 */
  .extern C1FIFOCI9INV     /* 0xBF8805CC */
  .extern C1FIFOCON10      /* 0xBF8805D0 */
  .extern C1FIFOCON10CLR   /* 0xBF8805D4 */
  .extern C1FIFOCON10SET   /* 0xBF8805D8 */
  .extern C1FIFOCON10INV   /* 0xBF8805DC */
  .extern C1FIFOINT10      /* 0xBF8805E0 */
  .extern C1FIFOINT10CLR   /* 0xBF8805E4 */
  .extern C1FIFOINT10SET   /* 0xBF8805E8 */
  .extern C1FIFOINT10INV   /* 0xBF8805EC */
  .extern C1FIFOUA10       /* 0xBF8805F0 */
  .extern C1FIFOUA10CLR    /* 0xBF8805F4 */
  .extern C1FIFOUA10SET    /* 0xBF8805F8 */
  .extern C1FIFOUA10INV    /* 0xBF8805FC */
  .extern C1FIFOCI10       /* 0xBF880600 */
  .extern C1FIFOCI10CLR    /* 0xBF880604 */
  .extern C1FIFOCI10SET    /* 0xBF880608 */
  .extern C1FIFOCI10INV    /* 0xBF88060C */
  .extern C1FIFOCON11      /* 0xBF880610 */
  .extern C1FIFOCON11CLR   /* 0xBF880614 */
  .extern C1FIFOCON11SET   /* 0xBF880618 */
  .extern C1FIFOCON11INV   /* 0xBF88061C */
  .extern C1FIFOINT11      /* 0xBF880620 */
  .extern C1FIFOINT11CLR   /* 0xBF880624 */
  .extern C1FIFOINT11SET   /* 0xBF880628 */
  .extern C1FIFOINT11INV   /* 0xBF88062C */
  .extern C1FIFOUA11       /* 0xBF880630 */
  .extern C1FIFOUA11CLR    /* 0xBF880634 */
  .extern C1FIFOUA11SET    /* 0xBF880638 */
  .extern C1FIFOUA11INV    /* 0xBF88063C */
  .extern C1FIFOCI11       /* 0xBF880640 */
  .extern C1FIFOCI11CLR    /* 0xBF880644 */
  .extern C1FIFOCI11SET    /* 0xBF880648 */
  .extern C1FIFOCI11INV    /* 0xBF88064C */
  .extern C1FIFOCON12      /* 0xBF880650 */
  .extern C1FIFOCON12CLR   /* 0xBF880654 */
  .extern C1FIFOCON12SET   /* 0xBF880658 */
  .extern C1FIFOCON12INV   /* 0xBF88065C */
  .extern C1FIFOINT12      /* 0xBF880660 */
  .extern C1FIFOINT12CLR   /* 0xBF880664 */
  .extern C1FIFOINT12SET   /* 0xBF880668 */
  .extern C1FIFOINT12INV   /* 0xBF88066C */
  .extern C1FIFOUA12       /* 0xBF880670 */
  .extern C1FIFOUA12CLR    /* 0xBF880674 */
  .extern C1FIFOUA12SET    /* 0xBF880678 */
  .extern C1FIFOUA12INV    /* 0xBF88067C */
  .extern C1FIFOCI12       /* 0xBF880680 */
  .extern C1FIFOCI12CLR    /* 0xBF880684 */
  .extern C1FIFOCI12SET    /* 0xBF880688 */
  .extern C1FIFOCI12INV    /* 0xBF88068C */
  .extern C1FIFOCON13      /* 0xBF880690 */
  .extern C1FIFOCON13CLR   /* 0xBF880694 */
  .extern C1FIFOCON13SET   /* 0xBF880698 */
  .extern C1FIFOCON13INV   /* 0xBF88069C */
  .extern C1FIFOINT13      /* 0xBF8806A0 */
  .extern C1FIFOINT13CLR   /* 0xBF8806A4 */
  .extern C1FIFOINT13SET   /* 0xBF8806A8 */
  .extern C1FIFOINT13INV   /* 0xBF8806AC */
  .extern C1FIFOUA13       /* 0xBF8806B0 */
  .extern C1FIFOUA13CLR    /* 0xBF8806B4 */
  .extern C1FIFOUA13SET    /* 0xBF8806B8 */
  .extern C1FIFOUA13INV    /* 0xBF8806BC */
  .extern C1FIFOCI13       /* 0xBF8806C0 */
  .extern C1FIFOCI13CLR    /* 0xBF8806C4 */
  .extern C1FIFOCI13SET    /* 0xBF8806C8 */
  .extern C1FIFOCI13INV    /* 0xBF8806CC */
  .extern C1FIFOCON14      /* 0xBF8806D0 */
  .extern C1FIFOCON14CLR   /* 0xBF8806D4 */
  .extern C1FIFOCON14SET   /* 0xBF8806D8 */
  .extern C1FIFOCON14INV   /* 0xBF8806DC */
  .extern C1FIFOINT14      /* 0xBF8806E0 */
  .extern C1FIFOINT14CLR   /* 0xBF8806E4 */
  .extern C1FIFOINT14SET   /* 0xBF8806E8 */
  .extern C1FIFOINT14INV   /* 0xBF8806EC */
  .extern C1FIFOUA14       /* 0xBF8806F0 */
  .extern C1FIFOUA14CLR    /* 0xBF8806F4 */
  .extern C1FIFOUA14SET    /* 0xBF8806F8 */
  .extern C1FIFOUA14INV    /* 0xBF8806FC */
  .extern C1FIFOCI14       /* 0xBF880700 */
  .extern C1FIFOCI14CLR    /* 0xBF880704 */
  .extern C1FIFOCI14SET    /* 0xBF880708 */
  .extern C1FIFOCI14INV    /* 0xBF88070C */
  .extern C1FIFOCON15      /* 0xBF880710 */
  .extern C1FIFOCON15CLR   /* 0xBF880714 */
  .extern C1FIFOCON15SET   /* 0xBF880718 */
  .extern C1FIFOCON15INV   /* 0xBF88071C */
  .extern C1FIFOINT15      /* 0xBF880720 */
  .extern C1FIFOINT15CLR   /* 0xBF880724 */
  .extern C1FIFOINT15SET   /* 0xBF880728 */
  .extern C1FIFOINT15INV   /* 0xBF88072C */
  .extern C1FIFOUA15       /* 0xBF880730 */
  .extern C1FIFOUA15CLR    /* 0xBF880734 */
  .extern C1FIFOUA15SET    /* 0xBF880738 */
  .extern C1FIFOUA15INV    /* 0xBF88073C */
  .extern C1FIFOCI15       /* 0xBF880740 */
  .extern C1FIFOCI15CLR    /* 0xBF880744 */
  .extern C1FIFOCI15SET    /* 0xBF880748 */
  .extern C1FIFOCI15INV    /* 0xBF88074C */
  .extern C1FIFOCON16      /* 0xBF880750 */
  .extern C1FIFOCON16CLR   /* 0xBF880754 */
  .extern C1FIFOCON16SET   /* 0xBF880758 */
  .extern C1FIFOCON16INV   /* 0xBF88075C */
  .extern C1FIFOINT16      /* 0xBF880760 */
  .extern C1FIFOINT16CLR   /* 0xBF880764 */
  .extern C1FIFOINT16SET   /* 0xBF880768 */
  .extern C1FIFOINT16INV   /* 0xBF88076C */
  .extern C1FIFOUA16       /* 0xBF880770 */
  .extern C1FIFOUA16CLR    /* 0xBF880774 */
  .extern C1FIFOUA16SET    /* 0xBF880778 */
  .extern C1FIFOUA16INV    /* 0xBF88077C */
  .extern C1FIFOCI16       /* 0xBF880780 */
  .extern C1FIFOCI16CLR    /* 0xBF880784 */
  .extern C1FIFOCI16SET    /* 0xBF880788 */
  .extern C1FIFOCI16INV    /* 0xBF88078C */
  .extern C1FIFOCON17      /* 0xBF880790 */
  .extern C1FIFOCON17CLR   /* 0xBF880794 */
  .extern C1FIFOCON17SET   /* 0xBF880798 */
  .extern C1FIFOCON17INV   /* 0xBF88079C */
  .extern C1FIFOINT17      /* 0xBF8807A0 */
  .extern C1FIFOINT17CLR   /* 0xBF8807A4 */
  .extern C1FIFOINT17SET   /* 0xBF8807A8 */
  .extern C1FIFOINT17INV   /* 0xBF8807AC */
  .extern C1FIFOUA17       /* 0xBF8807B0 */
  .extern C1FIFOUA17CLR    /* 0xBF8807B4 */
  .extern C1FIFOUA17SET    /* 0xBF8807B8 */
  .extern C1FIFOUA17INV    /* 0xBF8807BC */
  .extern C1FIFOCI17       /* 0xBF8807C0 */
  .extern C1FIFOCI17CLR    /* 0xBF8807C4 */
  .extern C1FIFOCI17SET    /* 0xBF8807C8 */
  .extern C1FIFOCI17INV    /* 0xBF8807CC */
  .extern C1FIFOCON18      /* 0xBF8807D0 */
  .extern C1FIFOCON18CLR   /* 0xBF8807D4 */
  .extern C1FIFOCON18SET   /* 0xBF8807D8 */
  .extern C1FIFOCON18INV   /* 0xBF8807DC */
  .extern C1FIFOINT18      /* 0xBF8807E0 */
  .extern C1FIFOINT18CLR   /* 0xBF8807E4 */
  .extern C1FIFOINT18SET   /* 0xBF8807E8 */
  .extern C1FIFOINT18INV   /* 0xBF8807EC */
  .extern C1FIFOUA18       /* 0xBF8807F0 */
  .extern C1FIFOUA18CLR    /* 0xBF8807F4 */
  .extern C1FIFOUA18SET    /* 0xBF8807F8 */
  .extern C1FIFOUA18INV    /* 0xBF8807FC */
  .extern C1FIFOCI18       /* 0xBF880800 */
  .extern C1FIFOCI18CLR    /* 0xBF880804 */
  .extern C1FIFOCI18SET    /* 0xBF880808 */
  .extern C1FIFOCI18INV    /* 0xBF88080C */
  .extern C1FIFOCON19      /* 0xBF880810 */
  .extern C1FIFOCON19CLR   /* 0xBF880814 */
  .extern C1FIFOCON19SET   /* 0xBF880818 */
  .extern C1FIFOCON19INV   /* 0xBF88081C */
  .extern C1FIFOINT19      /* 0xBF880820 */
  .extern C1FIFOINT19CLR   /* 0xBF880824 */
  .extern C1FIFOINT19SET   /* 0xBF880828 */
  .extern C1FIFOINT19INV   /* 0xBF88082C */
  .extern C1FIFOUA19       /* 0xBF880830 */
  .extern C1FIFOUA19CLR    /* 0xBF880834 */
  .extern C1FIFOUA19SET    /* 0xBF880838 */
  .extern C1FIFOUA19INV    /* 0xBF88083C */
  .extern C1FIFOCI19       /* 0xBF880840 */
  .extern C1FIFOCI19CLR    /* 0xBF880844 */
  .extern C1FIFOCI19SET    /* 0xBF880848 */
  .extern C1FIFOCI19INV    /* 0xBF88084C */
  .extern C1FIFOCON20      /* 0xBF880850 */
  .extern C1FIFOCON20CLR   /* 0xBF880854 */
  .extern C1FIFOCON20SET   /* 0xBF880858 */
  .extern C1FIFOCON20INV   /* 0xBF88085C */
  .extern C1FIFOINT20      /* 0xBF880860 */
  .extern C1FIFOINT20CLR   /* 0xBF880864 */
  .extern C1FIFOINT20SET   /* 0xBF880868 */
  .extern C1FIFOINT20INV   /* 0xBF88086C */
  .extern C1FIFOUA20       /* 0xBF880870 */
  .extern C1FIFOUA20CLR    /* 0xBF880874 */
  .extern C1FIFOUA20SET    /* 0xBF880878 */
  .extern C1FIFOUA20INV    /* 0xBF88087C */
  .extern C1FIFOCI20       /* 0xBF880880 */
  .extern C1FIFOCI20CLR    /* 0xBF880884 */
  .extern C1FIFOCI20SET    /* 0xBF880888 */
  .extern C1FIFOCI20INV    /* 0xBF88088C */
  .extern C1FIFOCON21      /* 0xBF880890 */
  .extern C1FIFOCON21CLR   /* 0xBF880894 */
  .extern C1FIFOCON21SET   /* 0xBF880898 */
  .extern C1FIFOCON21INV   /* 0xBF88089C */
  .extern C1FIFOINT21      /* 0xBF8808A0 */
  .extern C1FIFOINT21CLR   /* 0xBF8808A4 */
  .extern C1FIFOINT21SET   /* 0xBF8808A8 */
  .extern C1FIFOINT21INV   /* 0xBF8808AC */
  .extern C1FIFOUA21       /* 0xBF8808B0 */
  .extern C1FIFOUA21CLR    /* 0xBF8808B4 */
  .extern C1FIFOUA21SET    /* 0xBF8808B8 */
  .extern C1FIFOUA21INV    /* 0xBF8808BC */
  .extern C1FIFOCI21       /* 0xBF8808C0 */
  .extern C1FIFOCI21CLR    /* 0xBF8808C4 */
  .extern C1FIFOCI21SET    /* 0xBF8808C8 */
  .extern C1FIFOCI21INV    /* 0xBF8808CC */
  .extern C1FIFOCON22      /* 0xBF8808D0 */
  .extern C1FIFOCON22CLR   /* 0xBF8808D4 */
  .extern C1FIFOCON22SET   /* 0xBF8808D8 */
  .extern C1FIFOCON22INV   /* 0xBF8808DC */
  .extern C1FIFOINT22      /* 0xBF8808E0 */
  .extern C1FIFOINT22CLR   /* 0xBF8808E4 */
  .extern C1FIFOINT22SET   /* 0xBF8808E8 */
  .extern C1FIFOINT22INV   /* 0xBF8808EC */
  .extern C1FIFOUA22       /* 0xBF8808F0 */
  .extern C1FIFOUA22CLR    /* 0xBF8808F4 */
  .extern C1FIFOUA22SET    /* 0xBF8808F8 */
  .extern C1FIFOUA22INV    /* 0xBF8808FC */
  .extern C1FIFOCI22       /* 0xBF880900 */
  .extern C1FIFOCI22CLR    /* 0xBF880904 */
  .extern C1FIFOCI22SET    /* 0xBF880908 */
  .extern C1FIFOCI22INV    /* 0xBF88090C */
  .extern C1FIFOCON23      /* 0xBF880910 */
  .extern C1FIFOCON23CLR   /* 0xBF880914 */
  .extern C1FIFOCON23SET   /* 0xBF880918 */
  .extern C1FIFOCON23INV   /* 0xBF88091C */
  .extern C1FIFOINT23      /* 0xBF880920 */
  .extern C1FIFOINT23CLR   /* 0xBF880924 */
  .extern C1FIFOINT23SET   /* 0xBF880928 */
  .extern C1FIFOINT23INV   /* 0xBF88092C */
  .extern C1FIFOUA23       /* 0xBF880930 */
  .extern C1FIFOUA23CLR    /* 0xBF880934 */
  .extern C1FIFOUA23SET    /* 0xBF880938 */
  .extern C1FIFOUA23INV    /* 0xBF88093C */
  .extern C1FIFOCI23       /* 0xBF880940 */
  .extern C1FIFOCI23CLR    /* 0xBF880944 */
  .extern C1FIFOCI23SET    /* 0xBF880948 */
  .extern C1FIFOCI23INV    /* 0xBF88094C */
  .extern C1FIFOCON24      /* 0xBF880950 */
  .extern C1FIFOCON24CLR   /* 0xBF880954 */
  .extern C1FIFOCON24SET   /* 0xBF880958 */
  .extern C1FIFOCON24INV   /* 0xBF88095C */
  .extern C1FIFOINT24      /* 0xBF880960 */
  .extern C1FIFOINT24CLR   /* 0xBF880964 */
  .extern C1FIFOINT24SET   /* 0xBF880968 */
  .extern C1FIFOINT24INV   /* 0xBF88096C */
  .extern C1FIFOUA24       /* 0xBF880970 */
  .extern C1FIFOUA24CLR    /* 0xBF880974 */
  .extern C1FIFOUA24SET    /* 0xBF880978 */
  .extern C1FIFOUA24INV    /* 0xBF88097C */
  .extern C1FIFOCI24       /* 0xBF880980 */
  .extern C1FIFOCI24CLR    /* 0xBF880984 */
  .extern C1FIFOCI24SET    /* 0xBF880988 */
  .extern C1FIFOCI24INV    /* 0xBF88098C */
  .extern C1FIFOCON25      /* 0xBF880990 */
  .extern C1FIFOCON25CLR   /* 0xBF880994 */
  .extern C1FIFOCON25SET   /* 0xBF880998 */
  .extern C1FIFOCON25INV   /* 0xBF88099C */
  .extern C1FIFOINT25      /* 0xBF8809A0 */
  .extern C1FIFOINT25CLR   /* 0xBF8809A4 */
  .extern C1FIFOINT25SET   /* 0xBF8809A8 */
  .extern C1FIFOINT25INV   /* 0xBF8809AC */
  .extern C1FIFOUA25       /* 0xBF8809B0 */
  .extern C1FIFOUA25CLR    /* 0xBF8809B4 */
  .extern C1FIFOUA25SET    /* 0xBF8809B8 */
  .extern C1FIFOUA25INV    /* 0xBF8809BC */
  .extern C1FIFOCI25       /* 0xBF8809C0 */
  .extern C1FIFOCI25CLR    /* 0xBF8809C4 */
  .extern C1FIFOCI25SET    /* 0xBF8809C8 */
  .extern C1FIFOCI25INV    /* 0xBF8809CC */
  .extern C1FIFOCON26      /* 0xBF8809D0 */
  .extern C1FIFOCON26CLR   /* 0xBF8809D4 */
  .extern C1FIFOCON26SET   /* 0xBF8809D8 */
  .extern C1FIFOCON26INV   /* 0xBF8809DC */
  .extern C1FIFOINT26      /* 0xBF8809E0 */
  .extern C1FIFOINT26CLR   /* 0xBF8809E4 */
  .extern C1FIFOINT26SET   /* 0xBF8809E8 */
  .extern C1FIFOINT26INV   /* 0xBF8809EC */
  .extern C1FIFOUA26       /* 0xBF8809F0 */
  .extern C1FIFOUA26CLR    /* 0xBF8809F4 */
  .extern C1FIFOUA26SET    /* 0xBF8809F8 */
  .extern C1FIFOUA26INV    /* 0xBF8809FC */
  .extern C1FIFOCI26       /* 0xBF880A00 */
  .extern C1FIFOCI26CLR    /* 0xBF880A04 */
  .extern C1FIFOCI26SET    /* 0xBF880A08 */
  .extern C1FIFOCI26INV    /* 0xBF880A0C */
  .extern C1FIFOCON27      /* 0xBF880A10 */
  .extern C1FIFOCON27CLR   /* 0xBF880A14 */
  .extern C1FIFOCON27SET   /* 0xBF880A18 */
  .extern C1FIFOCON27INV   /* 0xBF880A1C */
  .extern C1FIFOINT27      /* 0xBF880A20 */
  .extern C1FIFOINT27CLR   /* 0xBF880A24 */
  .extern C1FIFOINT27SET   /* 0xBF880A28 */
  .extern C1FIFOINT27INV   /* 0xBF880A2C */
  .extern C1FIFOUA27       /* 0xBF880A30 */
  .extern C1FIFOUA27CLR    /* 0xBF880A34 */
  .extern C1FIFOUA27SET    /* 0xBF880A38 */
  .extern C1FIFOUA27INV    /* 0xBF880A3C */
  .extern C1FIFOCI27       /* 0xBF880A40 */
  .extern C1FIFOCI27CLR    /* 0xBF880A44 */
  .extern C1FIFOCI27SET    /* 0xBF880A48 */
  .extern C1FIFOCI27INV    /* 0xBF880A4C */
  .extern C1FIFOCON28      /* 0xBF880A50 */
  .extern C1FIFOCON28CLR   /* 0xBF880A54 */
  .extern C1FIFOCON28SET   /* 0xBF880A58 */
  .extern C1FIFOCON28INV   /* 0xBF880A5C */
  .extern C1FIFOINT28      /* 0xBF880A60 */
  .extern C1FIFOINT28CLR   /* 0xBF880A64 */
  .extern C1FIFOINT28SET   /* 0xBF880A68 */
  .extern C1FIFOINT28INV   /* 0xBF880A6C */
  .extern C1FIFOUA28       /* 0xBF880A70 */
  .extern C1FIFOUA28CLR    /* 0xBF880A74 */
  .extern C1FIFOUA28SET    /* 0xBF880A78 */
  .extern C1FIFOUA28INV    /* 0xBF880A7C */
  .extern C1FIFOCI28       /* 0xBF880A80 */
  .extern C1FIFOCI28CLR    /* 0xBF880A84 */
  .extern C1FIFOCI28SET    /* 0xBF880A88 */
  .extern C1FIFOCI28INV    /* 0xBF880A8C */
  .extern C1FIFOCON29      /* 0xBF880A90 */
  .extern C1FIFOCON29CLR   /* 0xBF880A94 */
  .extern C1FIFOCON29SET   /* 0xBF880A98 */
  .extern C1FIFOCON29INV   /* 0xBF880A9C */
  .extern C1FIFOINT29      /* 0xBF880AA0 */
  .extern C1FIFOINT29CLR   /* 0xBF880AA4 */
  .extern C1FIFOINT29SET   /* 0xBF880AA8 */
  .extern C1FIFOINT29INV   /* 0xBF880AAC */
  .extern C1FIFOUA29       /* 0xBF880AB0 */
  .extern C1FIFOUA29CLR    /* 0xBF880AB4 */
  .extern C1FIFOUA29SET    /* 0xBF880AB8 */
  .extern C1FIFOUA29INV    /* 0xBF880ABC */
  .extern C1FIFOCI29       /* 0xBF880AC0 */
  .extern C1FIFOCI29CLR    /* 0xBF880AC4 */
  .extern C1FIFOCI29SET    /* 0xBF880AC8 */
  .extern C1FIFOCI29INV    /* 0xBF880ACC */
  .extern C1FIFOCON30      /* 0xBF880AD0 */
  .extern C1FIFOCON30CLR   /* 0xBF880AD4 */
  .extern C1FIFOCON30SET   /* 0xBF880AD8 */
  .extern C1FIFOCON30INV   /* 0xBF880ADC */
  .extern C1FIFOINT30      /* 0xBF880AE0 */
  .extern C1FIFOINT30CLR   /* 0xBF880AE4 */
  .extern C1FIFOINT30SET   /* 0xBF880AE8 */
  .extern C1FIFOINT30INV   /* 0xBF880AEC */
  .extern C1FIFOUA30       /* 0xBF880AF0 */
  .extern C1FIFOUA30CLR    /* 0xBF880AF4 */
  .extern C1FIFOUA30SET    /* 0xBF880AF8 */
  .extern C1FIFOUA30INV    /* 0xBF880AFC */
  .extern C1FIFOCI30       /* 0xBF880B00 */
  .extern C1FIFOCI30CLR    /* 0xBF880B04 */
  .extern C1FIFOCI30SET    /* 0xBF880B08 */
  .extern C1FIFOCI30INV    /* 0xBF880B0C */
  .extern C1FIFOCON31      /* 0xBF880B10 */
