MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAR176/mcu.h
  .extern C2FIFOCI19SET    /* 0xBF881848 */
  .extern C2FIFOCI19INV    /* 0xBF88184C */
  .extern C2FIFOCON20      /* 0xBF881850 */
  .extern C2FIFOCON20CLR   /* 0xBF881854 */
  .extern C2FIFOCON20SET   /* 0xBF881858 */
  .extern C2FIFOCON20INV   /* 0xBF88185C */
  .extern C2FIFOINT20      /* 0xBF881860 */
  .extern C2FIFOINT20CLR   /* 0xBF881864 */
  .extern C2FIFOINT20SET   /* 0xBF881868 */
  .extern C2FIFOINT20INV   /* 0xBF88186C */
  .extern C2FIFOUA20       /* 0xBF881870 */
  .extern C2FIFOUA20CLR    /* 0xBF881874 */
  .extern C2FIFOUA20SET    /* 0xBF881878 */
  .extern C2FIFOUA20INV    /* 0xBF88187C */
  .extern C2FIFOCI20       /* 0xBF881880 */
  .extern C2FIFOCI20CLR    /* 0xBF881884 */
  .extern C2FIFOCI20SET    /* 0xBF881888 */
  .extern C2FIFOCI20INV    /* 0xBF88188C */
  .extern C2FIFOCON21      /* 0xBF881890 */
  .extern C2FIFOCON21CLR   /* 0xBF881894 */
  .extern C2FIFOCON21SET   /* 0xBF881898 */
  .extern C2FIFOCON21INV   /* 0xBF88189C */
  .extern C2FIFOINT21      /* 0xBF8818A0 */
  .extern C2FIFOINT21CLR   /* 0xBF8818A4 */
  .extern C2FIFOINT21SET   /* 0xBF8818A8 */
  .extern C2FIFOINT21INV   /* 0xBF8818AC */
  .extern C2FIFOUA21       /* 0xBF8818B0 */
  .extern C2FIFOUA21CLR    /* 0xBF8818B4 */
  .extern C2FIFOUA21SET    /* 0xBF8818B8 */
  .extern C2FIFOUA21INV    /* 0xBF8818BC */
  .extern C2FIFOCI21       /* 0xBF8818C0 */
  .extern C2FIFOCI21CLR    /* 0xBF8818C4 */
  .extern C2FIFOCI21SET    /* 0xBF8818C8 */
  .extern C2FIFOCI21INV    /* 0xBF8818CC */
  .extern C2FIFOCON22      /* 0xBF8818D0 */
  .extern C2FIFOCON22CLR   /* 0xBF8818D4 */
  .extern C2FIFOCON22SET   /* 0xBF8818D8 */
  .extern C2FIFOCON22INV   /* 0xBF8818DC */
  .extern C2FIFOINT22      /* 0xBF8818E0 */
  .extern C2FIFOINT22CLR   /* 0xBF8818E4 */
  .extern C2FIFOINT22SET   /* 0xBF8818E8 */
  .extern C2FIFOINT22INV   /* 0xBF8818EC */
  .extern C2FIFOUA22       /* 0xBF8818F0 */
  .extern C2FIFOUA22CLR    /* 0xBF8818F4 */
  .extern C2FIFOUA22SET    /* 0xBF8818F8 */
  .extern C2FIFOUA22INV    /* 0xBF8818FC */
  .extern C2FIFOCI22       /* 0xBF881900 */
  .extern C2FIFOCI22CLR    /* 0xBF881904 */
  .extern C2FIFOCI22SET    /* 0xBF881908 */
  .extern C2FIFOCI22INV    /* 0xBF88190C */
  .extern C2FIFOCON23      /* 0xBF881910 */
  .extern C2FIFOCON23CLR   /* 0xBF881914 */
  .extern C2FIFOCON23SET   /* 0xBF881918 */
  .extern C2FIFOCON23INV   /* 0xBF88191C */
  .extern C2FIFOINT23      /* 0xBF881920 */
  .extern C2FIFOINT23CLR   /* 0xBF881924 */
  .extern C2FIFOINT23SET   /* 0xBF881928 */
  .extern C2FIFOINT23INV   /* 0xBF88192C */
  .extern C2FIFOUA23       /* 0xBF881930 */
  .extern C2FIFOUA23CLR    /* 0xBF881934 */
  .extern C2FIFOUA23SET    /* 0xBF881938 */
  .extern C2FIFOUA23INV    /* 0xBF88193C */
  .extern C2FIFOCI23       /* 0xBF881940 */
  .extern C2FIFOCI23CLR    /* 0xBF881944 */
  .extern C2FIFOCI23SET    /* 0xBF881948 */
  .extern C2FIFOCI23INV    /* 0xBF88194C */
  .extern C2FIFOCON24      /* 0xBF881950 */
  .extern C2FIFOCON24CLR   /* 0xBF881954 */
  .extern C2FIFOCON24SET   /* 0xBF881958 */
  .extern C2FIFOCON24INV   /* 0xBF88195C */
  .extern C2FIFOINT24      /* 0xBF881960 */
  .extern C2FIFOINT24CLR   /* 0xBF881964 */
  .extern C2FIFOINT24SET   /* 0xBF881968 */
  .extern C2FIFOINT24INV   /* 0xBF88196C */
  .extern C2FIFOUA24       /* 0xBF881970 */
  .extern C2FIFOUA24CLR    /* 0xBF881974 */
  .extern C2FIFOUA24SET    /* 0xBF881978 */
  .extern C2FIFOUA24INV    /* 0xBF88197C */
  .extern C2FIFOCI24       /* 0xBF881980 */
  .extern C2FIFOCI24CLR    /* 0xBF881984 */
  .extern C2FIFOCI24SET    /* 0xBF881988 */
  .extern C2FIFOCI24INV    /* 0xBF88198C */
  .extern C2FIFOCON25      /* 0xBF881990 */
  .extern C2FIFOCON25CLR   /* 0xBF881994 */
  .extern C2FIFOCON25SET   /* 0xBF881998 */
  .extern C2FIFOCON25INV   /* 0xBF88199C */
  .extern C2FIFOINT25      /* 0xBF8819A0 */
  .extern C2FIFOINT25CLR   /* 0xBF8819A4 */
  .extern C2FIFOINT25SET   /* 0xBF8819A8 */
  .extern C2FIFOINT25INV   /* 0xBF8819AC */
  .extern C2FIFOUA25       /* 0xBF8819B0 */
  .extern C2FIFOUA25CLR    /* 0xBF8819B4 */
  .extern C2FIFOUA25SET    /* 0xBF8819B8 */
  .extern C2FIFOUA25INV    /* 0xBF8819BC */
  .extern C2FIFOCI25       /* 0xBF8819C0 */
  .extern C2FIFOCI25CLR    /* 0xBF8819C4 */
  .extern C2FIFOCI25SET    /* 0xBF8819C8 */
  .extern C2FIFOCI25INV    /* 0xBF8819CC */
  .extern C2FIFOCON26      /* 0xBF8819D0 */
  .extern C2FIFOCON26CLR   /* 0xBF8819D4 */
  .extern C2FIFOCON26SET   /* 0xBF8819D8 */
  .extern C2FIFOCON26INV   /* 0xBF8819DC */
  .extern C2FIFOINT26      /* 0xBF8819E0 */
  .extern C2FIFOINT26CLR   /* 0xBF8819E4 */
  .extern C2FIFOINT26SET   /* 0xBF8819E8 */
  .extern C2FIFOINT26INV   /* 0xBF8819EC */
  .extern C2FIFOUA26       /* 0xBF8819F0 */
  .extern C2FIFOUA26CLR    /* 0xBF8819F4 */
  .extern C2FIFOUA26SET    /* 0xBF8819F8 */
  .extern C2FIFOUA26INV    /* 0xBF8819FC */
  .extern C2FIFOCI26       /* 0xBF881A00 */
  .extern C2FIFOCI26CLR    /* 0xBF881A04 */
  .extern C2FIFOCI26SET    /* 0xBF881A08 */
  .extern C2FIFOCI26INV    /* 0xBF881A0C */
  .extern C2FIFOCON27      /* 0xBF881A10 */
  .extern C2FIFOCON27CLR   /* 0xBF881A14 */
  .extern C2FIFOCON27SET   /* 0xBF881A18 */
  .extern C2FIFOCON27INV   /* 0xBF881A1C */
  .extern C2FIFOINT27      /* 0xBF881A20 */
  .extern C2FIFOINT27CLR   /* 0xBF881A24 */
  .extern C2FIFOINT27SET   /* 0xBF881A28 */
  .extern C2FIFOINT27INV   /* 0xBF881A2C */
  .extern C2FIFOUA27       /* 0xBF881A30 */
  .extern C2FIFOUA27CLR    /* 0xBF881A34 */
  .extern C2FIFOUA27SET    /* 0xBF881A38 */
  .extern C2FIFOUA27INV    /* 0xBF881A3C */
  .extern C2FIFOCI27       /* 0xBF881A40 */
  .extern C2FIFOCI27CLR    /* 0xBF881A44 */
  .extern C2FIFOCI27SET    /* 0xBF881A48 */
  .extern C2FIFOCI27INV    /* 0xBF881A4C */
  .extern C2FIFOCON28      /* 0xBF881A50 */
  .extern C2FIFOCON28CLR   /* 0xBF881A54 */
  .extern C2FIFOCON28SET   /* 0xBF881A58 */
  .extern C2FIFOCON28INV   /* 0xBF881A5C */
  .extern C2FIFOINT28      /* 0xBF881A60 */
  .extern C2FIFOINT28CLR   /* 0xBF881A64 */
  .extern C2FIFOINT28SET   /* 0xBF881A68 */
  .extern C2FIFOINT28INV   /* 0xBF881A6C */
  .extern C2FIFOUA28       /* 0xBF881A70 */
  .extern C2FIFOUA28CLR    /* 0xBF881A74 */
  .extern C2FIFOUA28SET    /* 0xBF881A78 */
  .extern C2FIFOUA28INV    /* 0xBF881A7C */
  .extern C2FIFOCI28       /* 0xBF881A80 */
  .extern C2FIFOCI28CLR    /* 0xBF881A84 */
  .extern C2FIFOCI28SET    /* 0xBF881A88 */
  .extern C2FIFOCI28INV    /* 0xBF881A8C */
  .extern C2FIFOCON29      /* 0xBF881A90 */
  .extern C2FIFOCON29CLR   /* 0xBF881A94 */
  .extern C2FIFOCON29SET   /* 0xBF881A98 */
  .extern C2FIFOCON29INV   /* 0xBF881A9C */
  .extern C2FIFOINT29      /* 0xBF881AA0 */
  .extern C2FIFOINT29CLR   /* 0xBF881AA4 */
  .extern C2FIFOINT29SET   /* 0xBF881AA8 */
  .extern C2FIFOINT29INV   /* 0xBF881AAC */
  .extern C2FIFOUA29       /* 0xBF881AB0 */
  .extern C2FIFOUA29CLR    /* 0xBF881AB4 */
  .extern C2FIFOUA29SET    /* 0xBF881AB8 */
  .extern C2FIFOUA29INV    /* 0xBF881ABC */
  .extern C2FIFOCI29       /* 0xBF881AC0 */
  .extern C2FIFOCI29CLR    /* 0xBF881AC4 */
  .extern C2FIFOCI29SET    /* 0xBF881AC8 */
  .extern C2FIFOCI29INV    /* 0xBF881ACC */
  .extern C2FIFOCON30      /* 0xBF881AD0 */
  .extern C2FIFOCON30CLR   /* 0xBF881AD4 */
  .extern C2FIFOCON30SET   /* 0xBF881AD8 */
  .extern C2FIFOCON30INV   /* 0xBF881ADC */
  .extern C2FIFOINT30      /* 0xBF881AE0 */
  .extern C2FIFOINT30CLR   /* 0xBF881AE4 */
  .extern C2FIFOINT30SET   /* 0xBF881AE8 */
  .extern C2FIFOINT30INV   /* 0xBF881AEC */
  .extern C2FIFOUA30       /* 0xBF881AF0 */
  .extern C2FIFOUA30CLR    /* 0xBF881AF4 */
  .extern C2FIFOUA30SET    /* 0xBF881AF8 */
  .extern C2FIFOUA30INV    /* 0xBF881AFC */
  .extern C2FIFOCI30       /* 0xBF881B00 */
  .extern C2FIFOCI30CLR    /* 0xBF881B04 */
  .extern C2FIFOCI30SET    /* 0xBF881B08 */
  .extern C2FIFOCI30INV    /* 0xBF881B0C */
  .extern C2FIFOCON31      /* 0xBF881B10 */
  .extern C2FIFOCON31CLR   /* 0xBF881B14 */
  .extern C2FIFOCON31SET   /* 0xBF881B18 */
  .extern C2FIFOCON31INV   /* 0xBF881B1C */
  .extern C2FIFOINT31      /* 0xBF881B20 */
  .extern C2FIFOINT31CLR   /* 0xBF881B24 */
  .extern C2FIFOINT31SET   /* 0xBF881B28 */
  .extern C2FIFOINT31INV   /* 0xBF881B2C */
  .extern C2FIFOUA31       /* 0xBF881B30 */
  .extern C2FIFOUA31CLR    /* 0xBF881B34 */
  .extern C2FIFOUA31SET    /* 0xBF881B38 */
  .extern C2FIFOUA31INV    /* 0xBF881B3C */
  .extern C2FIFOCI31       /* 0xBF881B40 */
  .extern C2FIFOCI31CLR    /* 0xBF881B44 */
  .extern C2FIFOCI31SET    /* 0xBF881B48 */
  .extern C2FIFOCI31INV    /* 0xBF881B4C */
  .extern ETHCON1          /* 0xBF882000 */
  .extern ETHCON1CLR       /* 0xBF882004 */
  .extern ETHCON1SET       /* 0xBF882008 */
  .extern ETHCON1INV       /* 0xBF88200C */
  .extern ETHCON2          /* 0xBF882010 */
  .extern ETHCON2CLR       /* 0xBF882014 */
  .extern ETHCON2SET       /* 0xBF882018 */
  .extern ETHCON2INV       /* 0xBF88201C */
  .extern ETHTXST          /* 0xBF882020 */
  .extern ETHTXSTCLR       /* 0xBF882024 */
  .extern ETHTXSTSET       /* 0xBF882028 */
  .extern ETHTXSTINV       /* 0xBF88202C */
  .extern ETHRXST          /* 0xBF882030 */
  .extern ETHRXSTCLR       /* 0xBF882034 */
  .extern ETHRXSTSET       /* 0xBF882038 */
  .extern ETHRXSTINV       /* 0xBF88203C */
  .extern ETHHT0           /* 0xBF882040 */
  .extern ETHHT0CLR        /* 0xBF882044 */
  .extern ETHHT0SET        /* 0xBF882048 */
  .extern ETHHT0INV        /* 0xBF88204C */
  .extern ETHHT1           /* 0xBF882050 */
  .extern ETHHT1CLR        /* 0xBF882054 */
  .extern ETHHT1SET        /* 0xBF882058 */
  .extern ETHHT1INV        /* 0xBF88205C */
  .extern ETHPMM0          /* 0xBF882060 */
  .extern ETHPMM0CLR       /* 0xBF882064 */
  .extern ETHPMM0SET       /* 0xBF882068 */
  .extern ETHPMM0INV       /* 0xBF88206C */
  .extern ETHPMM1          /* 0xBF882070 */
  .extern ETHPMM1CLR       /* 0xBF882074 */
  .extern ETHPMM1SET       /* 0xBF882078 */
  .extern ETHPMM1INV       /* 0xBF88207C */
  .extern ETHPMCS          /* 0xBF882080 */
  .extern ETHPMCSCLR       /* 0xBF882084 */
  .extern ETHPMCSSET       /* 0xBF882088 */
  .extern ETHPMCSINV       /* 0xBF88208C */
  .extern ETHPMO           /* 0xBF882090 */
  .extern ETHPMOCLR        /* 0xBF882094 */
  .extern ETHPMOSET        /* 0xBF882098 */
  .extern ETHPMOINV        /* 0xBF88209C */
  .extern ETHRXFC          /* 0xBF8820A0 */
  .extern ETHRXFCCLR       /* 0xBF8820A4 */
  .extern ETHRXFCSET       /* 0xBF8820A8 */
  .extern ETHRXFCINV       /* 0xBF8820AC */
  .extern ETHRXWM          /* 0xBF8820B0 */
  .extern ETHRXWMCLR       /* 0xBF8820B4 */
  .extern ETHRXWMSET       /* 0xBF8820B8 */
  .extern ETHRXWMINV       /* 0xBF8820BC */
  .extern ETHIEN           /* 0xBF8820C0 */
  .extern ETHIENCLR        /* 0xBF8820C4 */
  .extern ETHIENSET        /* 0xBF8820C8 */
  .extern ETHIENINV        /* 0xBF8820CC */
  .extern ETHIRQ           /* 0xBF8820D0 */
  .extern ETHIRQCLR        /* 0xBF8820D4 */
  .extern ETHIRQSET        /* 0xBF8820D8 */
  .extern ETHIRQINV        /* 0xBF8820DC */
  .extern ETHSTAT          /* 0xBF8820E0 */
  .extern ETHSTATCLR       /* 0xBF8820E4 */
  .extern ETHSTATSET       /* 0xBF8820E8 */
  .extern ETHSTATINV       /* 0xBF8820EC */
  .extern ETHRXOVFLOW      /* 0xBF882100 */
  .extern ETHRXOVFLOWCLR   /* 0xBF882104 */
  .extern ETHRXOVFLOWSET   /* 0xBF882108 */
  .extern ETHRXOVFLOWINV   /* 0xBF88210C */
  .extern ETHFRMTXOK       /* 0xBF882110 */
  .extern ETHFRMTXOKCLR    /* 0xBF882114 */
  .extern ETHFRMTXOKSET    /* 0xBF882118 */
  .extern ETHFRMTXOKINV    /* 0xBF88211C */
  .extern ETHSCOLFRM       /* 0xBF882120 */
  .extern ETHSCOLFRMCLR    /* 0xBF882124 */
  .extern ETHSCOLFRMSET    /* 0xBF882128 */
  .extern ETHSCOLFRMINV    /* 0xBF88212C */
  .extern ETHMCOLFRM       /* 0xBF882130 */
  .extern ETHMCOLFRMCLR    /* 0xBF882134 */
  .extern ETHMCOLFRMSET    /* 0xBF882138 */
  .extern ETHMCOLFRMINV    /* 0xBF88213C */
  .extern ETHFRMRXOK       /* 0xBF882140 */
  .extern ETHFRMRXOKCLR    /* 0xBF882144 */
  .extern ETHFRMRXOKSET    /* 0xBF882148 */
  .extern ETHFRMRXOKINV    /* 0xBF88214C */
  .extern ETHFCSERR        /* 0xBF882150 */
  .extern ETHFCSERRCLR     /* 0xBF882154 */
  .extern ETHFCSERRSET     /* 0xBF882158 */
  .extern ETHFCSERRINV     /* 0xBF88215C */
  .extern ETHALGNERR       /* 0xBF882160 */
  .extern ETHALGNERRCLR    /* 0xBF882164 */
  .extern ETHALGNERRSET    /* 0xBF882168 */
  .extern ETHALGNERRINV    /* 0xBF88216C */
  .extern EMAC1CFG1        /* 0xBF882200 */
  .extern EMACxCFG1        /* 0xBF882200 */
  .extern EMAC1CFG1CLR     /* 0xBF882204 */
  .extern EMACxCFG1CLR     /* 0xBF882204 */
  .extern EMAC1CFG1SET     /* 0xBF882208 */
  .extern EMACxCFG1SET     /* 0xBF882208 */
  .extern EMAC1CFG1INV     /* 0xBF88220C */
  .extern EMACxCFG1INV     /* 0xBF88220C */
  .extern EMAC1CFG2        /* 0xBF882210 */
  .extern EMACxCFG2        /* 0xBF882210 */
  .extern EMAC1CFG2CLR     /* 0xBF882214 */
  .extern EMACxCFG2CLR     /* 0xBF882214 */
  .extern EMAC1CFG2SET     /* 0xBF882218 */
  .extern EMACxCFG2SET     /* 0xBF882218 */
  .extern EMAC1CFG2INV     /* 0xBF88221C */
  .extern EMACxCFG2INV     /* 0xBF88221C */
  .extern EMAC1IPGT        /* 0xBF882220 */
  .extern EMACxIPGT        /* 0xBF882220 */
  .extern EMAC1IPGTCLR     /* 0xBF882224 */
  .extern EMACxIPGTCLR     /* 0xBF882224 */
  .extern EMAC1IPGTSET     /* 0xBF882228 */
  .extern EMACxIPGTSET     /* 0xBF882228 */
  .extern EMAC1IPGTINV     /* 0xBF88222C */
  .extern EMACxIPGTINV     /* 0xBF88222C */
  .extern EMAC1IPGR        /* 0xBF882230 */
  .extern EMACxIPGR        /* 0xBF882230 */
  .extern EMAC1IPGRCLR     /* 0xBF882234 */
  .extern EMACxIPGRCLR     /* 0xBF882234 */
  .extern EMAC1IPGRSET     /* 0xBF882238 */
  .extern EMACxIPGRSET     /* 0xBF882238 */
  .extern EMAC1IPGRINV     /* 0xBF88223C */
  .extern EMACxIPGRINV     /* 0xBF88223C */
  .extern EMAC1CLRT        /* 0xBF882240 */
  .extern EMACxCLRT        /* 0xBF882240 */
  .extern EMAC1CLRTCLR     /* 0xBF882244 */
  .extern EMACxCLRTCLR     /* 0xBF882244 */
  .extern EMAC1CLRTSET     /* 0xBF882248 */
  .extern EMACxCLRTSET     /* 0xBF882248 */
  .extern EMAC1CLRTINV     /* 0xBF88224C */
  .extern EMACxCLRTINV     /* 0xBF88224C */
  .extern EMAC1MAXF        /* 0xBF882250 */
  .extern EMACxMAXF        /* 0xBF882250 */
  .extern EMAC1MAXFCLR     /* 0xBF882254 */
  .extern EMACxMAXFCLR     /* 0xBF882254 */
  .extern EMAC1MAXFSET     /* 0xBF882258 */
  .extern EMACxMAXFSET     /* 0xBF882258 */
  .extern EMAC1MAXFINV     /* 0xBF88225C */
  .extern EMACxMAXFINV     /* 0xBF88225C */
  .extern EMAC1SUPP        /* 0xBF882260 */
  .extern EMACxSUPP        /* 0xBF882260 */
  .extern EMAC1SUPPCLR     /* 0xBF882264 */
  .extern EMACxSUPPCLR     /* 0xBF882264 */
  .extern EMAC1SUPPSET     /* 0xBF882268 */
  .extern EMACxSUPPSET     /* 0xBF882268 */
  .extern EMAC1SUPPINV     /* 0xBF88226C */
  .extern EMACxSUPPINV     /* 0xBF88226C */
  .extern EMAC1TEST        /* 0xBF882270 */
  .extern EMACxTEST        /* 0xBF882270 */
  .extern EMAC1TESTCLR     /* 0xBF882274 */
  .extern EMACxTESTCLR     /* 0xBF882274 */
  .extern EMAC1TESTSET     /* 0xBF882278 */
  .extern EMACxTESTSET     /* 0xBF882278 */
  .extern EMAC1TESTINV     /* 0xBF88227C */
  .extern EMACxTESTINV     /* 0xBF88227C */
  .extern EMAC1MCFG        /* 0xBF882280 */
  .extern EMACxMCFG        /* 0xBF882280 */
  .extern EMAC1MCFGCLR     /* 0xBF882284 */
  .extern EMACxMCFGCLR     /* 0xBF882284 */
  .extern EMAC1MCFGSET     /* 0xBF882288 */
  .extern EMACxMCFGSET     /* 0xBF882288 */
  .extern EMAC1MCFGINV     /* 0xBF88228C */
  .extern EMACxMCFGINV     /* 0xBF88228C */
  .extern EMAC1MCMD        /* 0xBF882290 */
  .extern EMACxMCMD        /* 0xBF882290 */
  .extern EMAC1MCMDCLR     /* 0xBF882294 */
  .extern EMACxMCMDCLR     /* 0xBF882294 */
  .extern EMAC1MCMDSET     /* 0xBF882298 */
  .extern EMACxMCMDSET     /* 0xBF882298 */
  .extern EMAC1MCMDINV     /* 0xBF88229C */
  .extern EMACxMCMDINV     /* 0xBF88229C */
  .extern EMAC1MADR        /* 0xBF8822A0 */
  .extern EMACxMADR        /* 0xBF8822A0 */
  .extern EMAC1MADRCLR     /* 0xBF8822A4 */
  .extern EMACxMADRCLR     /* 0xBF8822A4 */
  .extern EMAC1MADRSET     /* 0xBF8822A8 */
  .extern EMACxMADRSET     /* 0xBF8822A8 */
  .extern EMAC1MADRINV     /* 0xBF8822AC */
  .extern EMACxMADRINV     /* 0xBF8822AC */
  .extern EMAC1MWTD        /* 0xBF8822B0 */
  .extern EMACxMWTD        /* 0xBF8822B0 */
  .extern EMAC1MWTDCLR     /* 0xBF8822B4 */
  .extern EMACxMWTDCLR     /* 0xBF8822B4 */
  .extern EMAC1MWTDSET     /* 0xBF8822B8 */
  .extern EMACxMWTDSET     /* 0xBF8822B8 */
  .extern EMAC1MWTDINV     /* 0xBF8822BC */
  .extern EMACxMWTDINV     /* 0xBF8822BC */
  .extern EMAC1MRDD        /* 0xBF8822C0 */
  .extern EMACxMRDD        /* 0xBF8822C0 */
  .extern EMAC1MRDDCLR     /* 0xBF8822C4 */
  .extern EMACxMRDDCLR     /* 0xBF8822C4 */
  .extern EMAC1MRDDSET     /* 0xBF8822C8 */
  .extern EMACxMRDDSET     /* 0xBF8822C8 */
  .extern EMAC1MRDDINV     /* 0xBF8822CC */
  .extern EMACxMRDDINV     /* 0xBF8822CC */
  .extern EMAC1MIND        /* 0xBF8822D0 */
  .extern EMACxMIND        /* 0xBF8822D0 */
  .extern EMAC1MINDCLR     /* 0xBF8822D4 */
  .extern EMACxMINDCLR     /* 0xBF8822D4 */
  .extern EMAC1MINDSET     /* 0xBF8822D8 */
  .extern EMACxMINDSET     /* 0xBF8822D8 */
  .extern EMAC1MINDINV     /* 0xBF8822DC */
  .extern EMACxMINDINV     /* 0xBF8822DC */
  .extern EMAC1SA0         /* 0xBF882300 */
  .extern EMACxSA0         /* 0xBF882300 */
  .extern EMAC1SA0CLR      /* 0xBF882304 */
  .extern EMACxSA0CLR      /* 0xBF882304 */
  .extern EMAC1SA0SET      /* 0xBF882308 */
  .extern EMACxSA0SET      /* 0xBF882308 */
  .extern EMAC1SA0INV      /* 0xBF88230C */
  .extern EMACxSA0INV      /* 0xBF88230C */
  .extern EMAC1SA1         /* 0xBF882310 */
  .extern EMACxSA1         /* 0xBF882310 */
  .extern EMAC1SA1CLR      /* 0xBF882314 */
  .extern EMACxSA1CLR      /* 0xBF882314 */
  .extern EMAC1SA1SET      /* 0xBF882318 */
  .extern EMACxSA1SET      /* 0xBF882318 */
  .extern EMAC1SA1INV      /* 0xBF88231C */
  .extern EMACxSA1INV      /* 0xBF88231C */
  .extern EMAC1SA2         /* 0xBF882320 */
  .extern EMACxSA2         /* 0xBF882320 */
  .extern EMAC1SA2CLR      /* 0xBF882324 */
  .extern EMACxSA2CLR      /* 0xBF882324 */
  .extern EMAC1SA2SET      /* 0xBF882328 */
  .extern EMACxSA2SET      /* 0xBF882328 */
  .extern EMAC1SA2INV      /* 0xBF88232C */
  .extern EMACxSA2INV      /* 0xBF88232C */
  .extern USBCRCON         /* 0xBF884000 */
  .extern RTCCON           /* 0xBF8C0000 */
  .extern RTCCONCLR        /* 0xBF8C0004 */
  .extern RTCCONSET        /* 0xBF8C0008 */
  .extern RTCCONINV        /* 0xBF8C000C */
  .extern RTCALRM          /* 0xBF8C0010 */
  .extern RTCALRMCLR       /* 0xBF8C0014 */
  .extern RTCALRMSET       /* 0xBF8C0018 */
  .extern RTCALRMINV       /* 0xBF8C001C */
  .extern RTCTIME          /* 0xBF8C0020 */
  .extern RTCTIMECLR       /* 0xBF8C0024 */
  .extern RTCTIMESET       /* 0xBF8C0028 */
  .extern RTCTIMEINV       /* 0xBF8C002C */
  .extern RTCDATE          /* 0xBF8C0030 */
  .extern RTCDATECLR       /* 0xBF8C0034 */
  .extern RTCDATESET       /* 0xBF8C0038 */
  .extern RTCDATEINV       /* 0xBF8C003C */
  .extern ALRMTIME         /* 0xBF8C0040 */
  .extern ALRMTIMECLR      /* 0xBF8C0044 */
  .extern ALRMTIMESET      /* 0xBF8C0048 */
  .extern ALRMTIMEINV      /* 0xBF8C004C */
  .extern ALRMDATE         /* 0xBF8C0050 */
  .extern ALRMDATECLR      /* 0xBF8C0054 */
  .extern ALRMDATESET      /* 0xBF8C0058 */
  .extern ALRMDATEINV      /* 0xBF8C005C */
  .extern DSCON            /* 0xBF8C0200 */
  .extern DSWAKE           /* 0xBF8C0210 */
  .extern DSGPR0           /* 0xBF8C0220 */
  .extern DSGPR1           /* 0xBF8C0240 */
  .extern DSGPR2           /* 0xBF8C0244 */
  .extern DSGPR3           /* 0xBF8C0248 */
  .extern DSGPR4           /* 0xBF8C024C */
  .extern DSGPR5           /* 0xBF8C0250 */
  .extern DSGPR6           /* 0xBF8C0254 */
  .extern DSGPR7           /* 0xBF8C0258 */
  .extern DSGPR8           /* 0xBF8C025C */
  .extern DSGPR9           /* 0xBF8C0260 */
  .extern DSGPR10          /* 0xBF8C0264 */
  .extern DSGPR11          /* 0xBF8C0268 */
  .extern DSGPR12          /* 0xBF8C026C */
  .extern DSGPR13          /* 0xBF8C0270 */
  .extern DSGPR14          /* 0xBF8C0274 */
  .extern DSGPR15          /* 0xBF8C0278 */
  .extern DSGPR16          /* 0xBF8C027C */
  .extern DSGPR17          /* 0xBF8C0280 */
  .extern DSGPR18          /* 0xBF8C0284 */
  .extern DSGPR19          /* 0xBF8C0288 */
  .extern DSGPR20          /* 0xBF8C028C */
  .extern DSGPR21          /* 0xBF8C0290 */
  .extern DSGPR22          /* 0xBF8C0294 */
  .extern DSGPR23          /* 0xBF8C0298 */
  .extern DSGPR24          /* 0xBF8C029C */
  .extern DSGPR25          /* 0xBF8C02A0 */
  .extern DSGPR26          /* 0xBF8C02A4 */
  .extern DSGPR27          /* 0xBF8C02A8 */
  .extern DSGPR28          /* 0xBF8C02AC */
  .extern DSGPR29          /* 0xBF8C02B0 */
  .extern DSGPR30          /* 0xBF8C02B4 */
  .extern DSGPR31          /* 0xBF8C02B8 */
  .extern DSGPR32          /* 0xBF8C02BC */
  .extern PRECON           /* 0xBF8E0000 */
  .extern PRECONCLR        /* 0xBF8E0004 */
  .extern PRECONSET        /* 0xBF8E0008 */
  .extern PRECONINV        /* 0xBF8E000C */
  .extern PRESTAT          /* 0xBF8E0010 */
  .extern PRESTATCLR       /* 0xBF8E0014 */
  .extern PRESTATSET       /* 0xBF8E0018 */
  .extern PRESTATINV       /* 0xBF8E001C */
  .extern EBICS0           /* 0xBF8E1014 */
  .extern EBICS1           /* 0xBF8E1018 */
  .extern EBICS2           /* 0xBF8E101C */
  .extern EBICS3           /* 0xBF8E1020 */
  .extern EBIMSK0          /* 0xBF8E1054 */
  .extern EBIMSK1          /* 0xBF8E1058 */
  .extern EBIMSK2          /* 0xBF8E105C */
  .extern EBIMSK3          /* 0xBF8E1060 */
  .extern EBISMT0          /* 0xBF8E1094 */
  .extern EBISMT1          /* 0xBF8E1098 */
  .extern EBISMT2          /* 0xBF8E109C */
  .extern EBIFTRPD         /* 0xBF8E10A0 */
  .extern EBISMCON         /* 0xBF8E10A4 */
  .extern SQI1XCON1        /* 0xBF8E2000 */
  .extern SQI1XCON2        /* 0xBF8E2004 */
  .extern SQI1CFG          /* 0xBF8E2008 */
  .extern SQI1CON          /* 0xBF8E200C */
  .extern SQI1CLKCON       /* 0xBF8E2010 */
  .extern SQI1CMDTHR       /* 0xBF8E2014 */
  .extern SQI1INTTHR       /* 0xBF8E2018 */
  .extern SQI1INTEN        /* 0xBF8E201C */
  .extern SQI1INTSTAT      /* 0xBF8E2020 */
  .extern SQI1TXDATA       /* 0xBF8E2024 */
  .extern SQI1RXDATA       /* 0xBF8E2028 */
  .extern SQI1STAT1        /* 0xBF8E202C */
  .extern SQI1STAT2        /* 0xBF8E2030 */
  .extern SQI1BDCON        /* 0xBF8E2034 */
  .extern SQI1BDCURADD     /* 0xBF8E2038 */
  .extern SQI1BDBASEADD    /* 0xBF8E2040 */
  .extern SQI1BDSTAT       /* 0xBF8E2044 */
  .extern SQI1BDPOLLCON    /* 0xBF8E2048 */
  .extern SQI1BDTXDSTAT    /* 0xBF8E204C */
  .extern SQI1BDRXDSTAT    /* 0xBF8E2050 */
  .extern SQI1THR          /* 0xBF8E2054 */
  .extern SQI1INTSIGEN     /* 0xBF8E2058 */
  .extern SQI1TAPCON       /* 0xBF8E205C */
  .extern SQI1MEMSTAT      /* 0xBF8E2060 */
  .extern SQI1XCON3        /* 0xBF8E2064 */
  .extern SQI1XCON4        /* 0xBF8E2068 */
  .extern USBCSR0          /* 0xBF8E3000 */
  .extern USBCSR1          /* 0xBF8E3004 */
  .extern USBCSR2          /* 0xBF8E3008 */
  .extern USBCSR3          /* 0xBF8E300C */
  .extern USBIENCSR1       /* 0xBF8E3014 */
  .extern USBFIFO0         /* 0xBF8E3020 */
  .extern USBFIFO1         /* 0xBF8E3024 */
  .extern USBFIFO2         /* 0xBF8E3028 */
  .extern USBFIFO3         /* 0xBF8E302C */
  .extern USBFIFO4         /* 0xBF8E3030 */
  .extern USBFIFO5         /* 0xBF8E3034 */
  .extern USBFIFO6         /* 0xBF8E3038 */
  .extern USBFIFO7         /* 0xBF8E303C */
  .extern USBOTG           /* 0xBF8E3060 */
  .extern USBFIFOA         /* 0xBF8E3064 */
  .extern USBHWVER         /* 0xBF8E306C */
  .extern USBINFO          /* 0xBF8E3078 */
  .extern USBEOFRST        /* 0xBF8E307C */
  .extern USBE0TXA         /* 0xBF8E3080 */
  .extern USBE0RXA         /* 0xBF8E3084 */
