MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAR176/mcu.h
#define _DDRCMD115_RASCMD1_POSITION              0x00000009
#define _DDRCMD115_RASCMD1_MASK                  0x00000200
#define _DDRCMD115_RASCMD1_LENGTH                0x00000001

#define _DDRCMD115_CASCMD1_POSITION              0x0000000A
#define _DDRCMD115_CASCMD1_MASK                  0x00000400
#define _DDRCMD115_CASCMD1_LENGTH                0x00000001

#define _DDRCMD115_WENCMD1_POSITION              0x0000000B
#define _DDRCMD115_WENCMD1_MASK                  0x00000800
#define _DDRCMD115_WENCMD1_LENGTH                0x00000001

#define _DDRCMD115_CLKENCMD2_POSITION            0x0000000C
#define _DDRCMD115_CLKENCMD2_MASK                0x00001000
#define _DDRCMD115_CLKENCMD2_LENGTH              0x00000001

#define _DDRCMD115_CSCMD2_POSITION               0x0000000D
#define _DDRCMD115_CSCMD2_MASK                   0x001FE000
#define _DDRCMD115_CSCMD2_LENGTH                 0x00000008

#define _DDRCMD115_RASCMD2_POSITION              0x00000015
#define _DDRCMD115_RASCMD2_MASK                  0x00200000
#define _DDRCMD115_RASCMD2_LENGTH                0x00000001

#define _DDRCMD115_CASCMD2_POSITION              0x00000016
#define _DDRCMD115_CASCMD2_MASK                  0x00400000
#define _DDRCMD115_CASCMD2_LENGTH                0x00000001

#define _DDRCMD115_WENCMD2_POSITION              0x00000017
#define _DDRCMD115_WENCMD2_MASK                  0x00800000
#define _DDRCMD115_WENCMD2_LENGTH                0x00000001

#define _DDRCMD115_MDALCMD_POSITION              0x00000018
#define _DDRCMD115_MDALCMD_MASK                  0xFF000000
#define _DDRCMD115_MDALCMD_LENGTH                0x00000008

#define _DDRCMD20_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD20_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD20_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD20_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD20_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD20_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD20_WAIT_POSITION                  0x0000000B
#define _DDRCMD20_WAIT_MASK                      0x000FF800
#define _DDRCMD20_WAIT_LENGTH                    0x00000009

#define _DDRCMD21_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD21_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD21_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD21_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD21_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD21_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD21_WAIT_POSITION                  0x0000000B
#define _DDRCMD21_WAIT_MASK                      0x000FF800
#define _DDRCMD21_WAIT_LENGTH                    0x00000009

#define _DDRCMD22_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD22_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD22_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD22_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD22_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD22_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD22_WAIT_POSITION                  0x0000000B
#define _DDRCMD22_WAIT_MASK                      0x000FF800
#define _DDRCMD22_WAIT_LENGTH                    0x00000009

#define _DDRCMD23_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD23_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD23_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD23_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD23_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD23_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD23_WAIT_POSITION                  0x0000000B
#define _DDRCMD23_WAIT_MASK                      0x000FF800
#define _DDRCMD23_WAIT_LENGTH                    0x00000009

#define _DDRCMD24_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD24_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD24_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD24_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD24_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD24_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD24_WAIT_POSITION                  0x0000000B
#define _DDRCMD24_WAIT_MASK                      0x000FF800
#define _DDRCMD24_WAIT_LENGTH                    0x00000009

#define _DDRCMD25_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD25_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD25_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD25_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD25_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD25_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD25_WAIT_POSITION                  0x0000000B
#define _DDRCMD25_WAIT_MASK                      0x000FF800
#define _DDRCMD25_WAIT_LENGTH                    0x00000009

#define _DDRCMD26_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD26_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD26_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD26_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD26_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD26_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD26_WAIT_POSITION                  0x0000000B
#define _DDRCMD26_WAIT_MASK                      0x000FF800
#define _DDRCMD26_WAIT_LENGTH                    0x00000009

#define _DDRCMD27_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD27_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD27_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD27_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD27_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD27_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD27_WAIT_POSITION                  0x0000000B
#define _DDRCMD27_WAIT_MASK                      0x000FF800
#define _DDRCMD27_WAIT_LENGTH                    0x00000009

#define _DDRCMD28_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD28_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD28_MDADDRHCMD_LENGTH              0x00000008

