MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAR176/mcu.h
#define _GLCDCURDATA4_PIXEL17_POSITION           0x00000000
#define _GLCDCURDATA4_PIXEL17_MASK               0x0000000F
#define _GLCDCURDATA4_PIXEL17_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL16_POSITION           0x00000004
#define _GLCDCURDATA4_PIXEL16_MASK               0x000000F0
#define _GLCDCURDATA4_PIXEL16_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL15_POSITION           0x00000008
#define _GLCDCURDATA4_PIXEL15_MASK               0x00000F00
#define _GLCDCURDATA4_PIXEL15_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL14_POSITION           0x0000000C
#define _GLCDCURDATA4_PIXEL14_MASK               0x0000F000
#define _GLCDCURDATA4_PIXEL14_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL13_POSITION           0x00000010
#define _GLCDCURDATA4_PIXEL13_MASK               0x000F0000
#define _GLCDCURDATA4_PIXEL13_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL12_POSITION           0x00000014
#define _GLCDCURDATA4_PIXEL12_MASK               0x00F00000
#define _GLCDCURDATA4_PIXEL12_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL11_POSITION           0x00000018
#define _GLCDCURDATA4_PIXEL11_MASK               0x0F000000
#define _GLCDCURDATA4_PIXEL11_LENGTH             0x00000004

#define _GLCDCURDATA4_PIXEL10_POSITION           0x0000001C
#define _GLCDCURDATA4_PIXEL10_MASK               0xF0000000
#define _GLCDCURDATA4_PIXEL10_LENGTH             0x00000004

#define _GLCDCURDATA5_PIXEL115_POSITION          0x00000000
#define _GLCDCURDATA5_PIXEL115_MASK              0x0000000F
#define _GLCDCURDATA5_PIXEL115_LENGTH            0x00000004

#define _GLCDCURDATA5_PIXEL114_POSITION          0x00000004
#define _GLCDCURDATA5_PIXEL114_MASK              0x000000F0
#define _GLCDCURDATA5_PIXEL114_LENGTH            0x00000004

#define _GLCDCURDATA5_PIXEL113_POSITION          0x00000008
#define _GLCDCURDATA5_PIXEL113_MASK              0x00000F00
#define _GLCDCURDATA5_PIXEL113_LENGTH            0x00000004

#define _GLCDCURDATA5_PIXEL112_POSITION          0x0000000C
#define _GLCDCURDATA5_PIXEL112_MASK              0x0000F000
#define _GLCDCURDATA5_PIXEL112_LENGTH            0x00000004

#define _GLCDCURDATA5_PIXEL111_POSITION          0x00000010
#define _GLCDCURDATA5_PIXEL111_MASK              0x000F0000
#define _GLCDCURDATA5_PIXEL111_LENGTH            0x00000004

#define _GLCDCURDATA5_PIXEL110_POSITION          0x00000014
#define _GLCDCURDATA5_PIXEL110_MASK              0x00F00000
#define _GLCDCURDATA5_PIXEL110_LENGTH            0x00000004

#define _GLCDCURDATA5_PIXEL19_POSITION           0x00000018
#define _GLCDCURDATA5_PIXEL19_MASK               0x0F000000
#define _GLCDCURDATA5_PIXEL19_LENGTH             0x00000004

#define _GLCDCURDATA5_PIXEL18_POSITION           0x0000001C
#define _GLCDCURDATA5_PIXEL18_MASK               0xF0000000
#define _GLCDCURDATA5_PIXEL18_LENGTH             0x00000004

#define _GLCDCURDATA6_PIXEL123_POSITION          0x00000000
#define _GLCDCURDATA6_PIXEL123_MASK              0x0000000F
#define _GLCDCURDATA6_PIXEL123_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL122_POSITION          0x00000004
#define _GLCDCURDATA6_PIXEL122_MASK              0x000000F0
#define _GLCDCURDATA6_PIXEL122_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL121_POSITION          0x00000008
#define _GLCDCURDATA6_PIXEL121_MASK              0x00000F00
#define _GLCDCURDATA6_PIXEL121_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL120_POSITION          0x0000000C
#define _GLCDCURDATA6_PIXEL120_MASK              0x0000F000
#define _GLCDCURDATA6_PIXEL120_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL119_POSITION          0x00000010
#define _GLCDCURDATA6_PIXEL119_MASK              0x000F0000
#define _GLCDCURDATA6_PIXEL119_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL118_POSITION          0x00000014
#define _GLCDCURDATA6_PIXEL118_MASK              0x00F00000
#define _GLCDCURDATA6_PIXEL118_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL117_POSITION          0x00000018
#define _GLCDCURDATA6_PIXEL117_MASK              0x0F000000
#define _GLCDCURDATA6_PIXEL117_LENGTH            0x00000004

#define _GLCDCURDATA6_PIXEL116_POSITION          0x0000001C
#define _GLCDCURDATA6_PIXEL116_MASK              0xF0000000
#define _GLCDCURDATA6_PIXEL116_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL131_POSITION          0x00000000
#define _GLCDCURDATA7_PIXEL131_MASK              0x0000000F
#define _GLCDCURDATA7_PIXEL131_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL130_POSITION          0x00000004
#define _GLCDCURDATA7_PIXEL130_MASK              0x000000F0
#define _GLCDCURDATA7_PIXEL130_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL129_POSITION          0x00000008
#define _GLCDCURDATA7_PIXEL129_MASK              0x00000F00
#define _GLCDCURDATA7_PIXEL129_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL128_POSITION          0x0000000C
#define _GLCDCURDATA7_PIXEL128_MASK              0x0000F000
#define _GLCDCURDATA7_PIXEL128_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL127_POSITION          0x00000010
#define _GLCDCURDATA7_PIXEL127_MASK              0x000F0000
#define _GLCDCURDATA7_PIXEL127_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL126_POSITION          0x00000014
#define _GLCDCURDATA7_PIXEL126_MASK              0x00F00000
#define _GLCDCURDATA7_PIXEL126_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL125_POSITION          0x00000018
#define _GLCDCURDATA7_PIXEL125_MASK              0x0F000000
#define _GLCDCURDATA7_PIXEL125_LENGTH            0x00000004

#define _GLCDCURDATA7_PIXEL124_POSITION          0x0000001C
#define _GLCDCURDATA7_PIXEL124_MASK              0xF0000000
#define _GLCDCURDATA7_PIXEL124_LENGTH            0x00000004

#define _GLCDCURDATA8_PIXEL27_POSITION           0x00000000
#define _GLCDCURDATA8_PIXEL27_MASK               0x0000000F
#define _GLCDCURDATA8_PIXEL27_LENGTH             0x00000004

#define _GLCDCURDATA8_PIXEL26_POSITION           0x00000004
#define _GLCDCURDATA8_PIXEL26_MASK               0x000000F0
#define _GLCDCURDATA8_PIXEL26_LENGTH             0x00000004

#define _GLCDCURDATA8_PIXEL25_POSITION           0x00000008
#define _GLCDCURDATA8_PIXEL25_MASK               0x00000F00
#define _GLCDCURDATA8_PIXEL25_LENGTH             0x00000004

