MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAR176/mcu.h
#define _GLCDCURDATA78_PIXEL1916_POSITION        0x0000001C
#define _GLCDCURDATA78_PIXEL1916_MASK            0xF0000000
#define _GLCDCURDATA78_PIXEL1916_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1931_POSITION        0x00000000
#define _GLCDCURDATA79_PIXEL1931_MASK            0x0000000F
#define _GLCDCURDATA79_PIXEL1931_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1930_POSITION        0x00000004
#define _GLCDCURDATA79_PIXEL1930_MASK            0x000000F0
#define _GLCDCURDATA79_PIXEL1930_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1929_POSITION        0x00000008
#define _GLCDCURDATA79_PIXEL1929_MASK            0x00000F00
#define _GLCDCURDATA79_PIXEL1929_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1928_POSITION        0x0000000C
#define _GLCDCURDATA79_PIXEL1928_MASK            0x0000F000
#define _GLCDCURDATA79_PIXEL1928_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1927_POSITION        0x00000010
#define _GLCDCURDATA79_PIXEL1927_MASK            0x000F0000
#define _GLCDCURDATA79_PIXEL1927_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1926_POSITION        0x00000014
#define _GLCDCURDATA79_PIXEL1926_MASK            0x00F00000
#define _GLCDCURDATA79_PIXEL1926_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1925_POSITION        0x00000018
#define _GLCDCURDATA79_PIXEL1925_MASK            0x0F000000
#define _GLCDCURDATA79_PIXEL1925_LENGTH          0x00000004

#define _GLCDCURDATA79_PIXEL1924_POSITION        0x0000001C
#define _GLCDCURDATA79_PIXEL1924_MASK            0xF0000000
#define _GLCDCURDATA79_PIXEL1924_LENGTH          0x00000004

#define _GLCDCURDATA80_PIXEL207_POSITION         0x00000000
#define _GLCDCURDATA80_PIXEL207_MASK             0x0000000F
#define _GLCDCURDATA80_PIXEL207_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL206_POSITION         0x00000004
#define _GLCDCURDATA80_PIXEL206_MASK             0x000000F0
#define _GLCDCURDATA80_PIXEL206_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL205_POSITION         0x00000008
#define _GLCDCURDATA80_PIXEL205_MASK             0x00000F00
#define _GLCDCURDATA80_PIXEL205_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL204_POSITION         0x0000000C
#define _GLCDCURDATA80_PIXEL204_MASK             0x0000F000
#define _GLCDCURDATA80_PIXEL204_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL203_POSITION         0x00000010
#define _GLCDCURDATA80_PIXEL203_MASK             0x000F0000
#define _GLCDCURDATA80_PIXEL203_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL202_POSITION         0x00000014
#define _GLCDCURDATA80_PIXEL202_MASK             0x00F00000
#define _GLCDCURDATA80_PIXEL202_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL201_POSITION         0x00000018
#define _GLCDCURDATA80_PIXEL201_MASK             0x0F000000
#define _GLCDCURDATA80_PIXEL201_LENGTH           0x00000004

#define _GLCDCURDATA80_PIXEL200_POSITION         0x0000001C
#define _GLCDCURDATA80_PIXEL200_MASK             0xF0000000
#define _GLCDCURDATA80_PIXEL200_LENGTH           0x00000004

#define _GLCDCURDATA81_PIXEL2015_POSITION        0x00000000
#define _GLCDCURDATA81_PIXEL2015_MASK            0x0000000F
#define _GLCDCURDATA81_PIXEL2015_LENGTH          0x00000004

#define _GLCDCURDATA81_PIXEL2014_POSITION        0x00000004
#define _GLCDCURDATA81_PIXEL2014_MASK            0x000000F0
#define _GLCDCURDATA81_PIXEL2014_LENGTH          0x00000004

#define _GLCDCURDATA81_PIXEL2013_POSITION        0x00000008
#define _GLCDCURDATA81_PIXEL2013_MASK            0x00000F00
#define _GLCDCURDATA81_PIXEL2013_LENGTH          0x00000004

#define _GLCDCURDATA81_PIXEL2012_POSITION        0x0000000C
#define _GLCDCURDATA81_PIXEL2012_MASK            0x0000F000
#define _GLCDCURDATA81_PIXEL2012_LENGTH          0x00000004

#define _GLCDCURDATA81_PIXEL2011_POSITION        0x00000010
#define _GLCDCURDATA81_PIXEL2011_MASK            0x000F0000
#define _GLCDCURDATA81_PIXEL2011_LENGTH          0x00000004

#define _GLCDCURDATA81_PIXEL2010_POSITION        0x00000014
#define _GLCDCURDATA81_PIXEL2010_MASK            0x00F00000
#define _GLCDCURDATA81_PIXEL2010_LENGTH          0x00000004

#define _GLCDCURDATA81_PIXEL209_POSITION         0x00000018
#define _GLCDCURDATA81_PIXEL209_MASK             0x0F000000
#define _GLCDCURDATA81_PIXEL209_LENGTH           0x00000004

#define _GLCDCURDATA81_PIXEL208_POSITION         0x0000001C
#define _GLCDCURDATA81_PIXEL208_MASK             0xF0000000
#define _GLCDCURDATA81_PIXEL208_LENGTH           0x00000004

#define _GLCDCURDATA82_PIXEL2023_POSITION        0x00000000
#define _GLCDCURDATA82_PIXEL2023_MASK            0x0000000F
#define _GLCDCURDATA82_PIXEL2023_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2022_POSITION        0x00000004
#define _GLCDCURDATA82_PIXEL2022_MASK            0x000000F0
#define _GLCDCURDATA82_PIXEL2022_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2021_POSITION        0x00000008
#define _GLCDCURDATA82_PIXEL2021_MASK            0x00000F00
#define _GLCDCURDATA82_PIXEL2021_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2020_POSITION        0x0000000C
#define _GLCDCURDATA82_PIXEL2020_MASK            0x0000F000
#define _GLCDCURDATA82_PIXEL2020_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2019_POSITION        0x00000010
#define _GLCDCURDATA82_PIXEL2019_MASK            0x000F0000
#define _GLCDCURDATA82_PIXEL2019_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2018_POSITION        0x00000014
#define _GLCDCURDATA82_PIXEL2018_MASK            0x00F00000
#define _GLCDCURDATA82_PIXEL2018_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2017_POSITION        0x00000018
#define _GLCDCURDATA82_PIXEL2017_MASK            0x0F000000
#define _GLCDCURDATA82_PIXEL2017_LENGTH          0x00000004

#define _GLCDCURDATA82_PIXEL2016_POSITION        0x0000001C
#define _GLCDCURDATA82_PIXEL2016_MASK            0xF0000000
#define _GLCDCURDATA82_PIXEL2016_LENGTH          0x00000004

#define _GLCDCURDATA83_PIXEL2031_POSITION        0x00000000
#define _GLCDCURDATA83_PIXEL2031_MASK            0x0000000F
#define _GLCDCURDATA83_PIXEL2031_LENGTH          0x00000004

#define _GLCDCURDATA83_PIXEL2030_POSITION        0x00000004
#define _GLCDCURDATA83_PIXEL2030_MASK            0x000000F0
#define _GLCDCURDATA83_PIXEL2030_LENGTH          0x00000004

